package ua.jvdevpro.smlnk;

/** Полиморфизм представляет собой концепцию,предполагающую использование единого имени(идентификатора) при обращении к
 * объектам нескольких разных классов, при условии, что все они являются подклассами одного общего суперкласса.
 *
 * Для каждого типа возвращаемой переменной можно реализовать свой метод, который будет отличаться типом возвращаемой
 * переменной и списком параметров, но имя метода будет одинаковым. Такие методы называются перегруженными и относятся
 * к «раннему» связыванию. Т.е., вариант вызванного метода определяется еще на этапе компиляции.*/

public class Multiply {

    // перегруженные методы

    int mul(int a,int b,int c){
        return a*b*c;
    }
    double mul(double a, double b, double c){
        return a*b*c;
    }

    String mul(String a, String b, String c){
        return a+b+c;
    }

}
